MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F100VB/mcu.h
/********************  Bit definition for CEC_ESR register  ******************/
#define CEC_ESR_BTE_Pos          (0U)                                          
#define CEC_ESR_BTE_Msk          (0x1UL << CEC_ESR_BTE_Pos)                     /*!< 0x00000001 */
#define CEC_ESR_BTE              CEC_ESR_BTE_Msk                               /*!<  Bit Timing Error */
#define CEC_ESR_BPE_Pos          (1U)                                          
#define CEC_ESR_BPE_Msk          (0x1UL << CEC_ESR_BPE_Pos)                     /*!< 0x00000002 */
#define CEC_ESR_BPE              CEC_ESR_BPE_Msk                               /*!<  Bit Period Error */
#define CEC_ESR_RBTFE_Pos        (2U)                                          
#define CEC_ESR_RBTFE_Msk        (0x1UL << CEC_ESR_RBTFE_Pos)                   /*!< 0x00000004 */
#define CEC_ESR_RBTFE            CEC_ESR_RBTFE_Msk                             /*!<  Rx Block Transfer Finished Error */
#define CEC_ESR_SBE_Pos          (3U)                                          
#define CEC_ESR_SBE_Msk          (0x1UL << CEC_ESR_SBE_Pos)                     /*!< 0x00000008 */
#define CEC_ESR_SBE              CEC_ESR_SBE_Msk                               /*!<  Start Bit Error */
#define CEC_ESR_ACKE_Pos         (4U)                                          
#define CEC_ESR_ACKE_Msk         (0x1UL << CEC_ESR_ACKE_Pos)                    /*!< 0x00000010 */
#define CEC_ESR_ACKE             CEC_ESR_ACKE_Msk                              /*!<  Block Acknowledge Error */
#define CEC_ESR_LINE_Pos         (5U)                                          
#define CEC_ESR_LINE_Msk         (0x1UL << CEC_ESR_LINE_Pos)                    /*!< 0x00000020 */
#define CEC_ESR_LINE             CEC_ESR_LINE_Msk                              /*!<  Line Error */
#define CEC_ESR_TBTFE_Pos        (6U)                                          
#define CEC_ESR_TBTFE_Msk        (0x1UL << CEC_ESR_TBTFE_Pos)                   /*!< 0x00000040 */
#define CEC_ESR_TBTFE            CEC_ESR_TBTFE_Msk                             /*!<  Tx Block Transfer Finished Error */

/********************  Bit definition for CEC_CSR register  ******************/
#define CEC_CSR_TSOM_Pos         (0U)                                          
#define CEC_CSR_TSOM_Msk         (0x1UL << CEC_CSR_TSOM_Pos)                    /*!< 0x00000001 */
#define CEC_CSR_TSOM             CEC_CSR_TSOM_Msk                              /*!<  Tx Start Of Message */
#define CEC_CSR_TEOM_Pos         (1U)                                          
#define CEC_CSR_TEOM_Msk         (0x1UL << CEC_CSR_TEOM_Pos)                    /*!< 0x00000002 */
#define CEC_CSR_TEOM             CEC_CSR_TEOM_Msk                              /*!<  Tx End Of Message */
#define CEC_CSR_TERR_Pos         (2U)                                          
#define CEC_CSR_TERR_Msk         (0x1UL << CEC_CSR_TERR_Pos)                    /*!< 0x00000004 */
#define CEC_CSR_TERR             CEC_CSR_TERR_Msk                              /*!<  Tx Error */
#define CEC_CSR_TBTRF_Pos        (3U)                                          
#define CEC_CSR_TBTRF_Msk        (0x1UL << CEC_CSR_TBTRF_Pos)                   /*!< 0x00000008 */
#define CEC_CSR_TBTRF            CEC_CSR_TBTRF_Msk                             /*!<  Tx Byte Transfer Request or Block Transfer Finished */
#define CEC_CSR_RSOM_Pos         (4U)                                          
#define CEC_CSR_RSOM_Msk         (0x1UL << CEC_CSR_RSOM_Pos)                    /*!< 0x00000010 */
#define CEC_CSR_RSOM             CEC_CSR_RSOM_Msk                              /*!<  Rx Start Of Message */
#define CEC_CSR_REOM_Pos         (5U)                                          
#define CEC_CSR_REOM_Msk         (0x1UL << CEC_CSR_REOM_Pos)                    /*!< 0x00000020 */
#define CEC_CSR_REOM             CEC_CSR_REOM_Msk                              /*!<  Rx End Of Message */
#define CEC_CSR_RERR_Pos         (6U)                                          
#define CEC_CSR_RERR_Msk         (0x1UL << CEC_CSR_RERR_Pos)                    /*!< 0x00000040 */
#define CEC_CSR_RERR             CEC_CSR_RERR_Msk                              /*!<  Rx Error */
#define CEC_CSR_RBTF_Pos         (7U)                                          
#define CEC_CSR_RBTF_Msk         (0x1UL << CEC_CSR_RBTF_Pos)                    /*!< 0x00000080 */
#define CEC_CSR_RBTF             CEC_CSR_RBTF_Msk                              /*!<  Rx Block Transfer Finished */

/********************  Bit definition for CEC_TXD register  ******************/
#define CEC_TXD_TXD_Pos          (0U)                                          
#define CEC_TXD_TXD_Msk          (0xFFUL << CEC_TXD_TXD_Pos)                    /*!< 0x000000FF */
#define CEC_TXD_TXD              CEC_TXD_TXD_Msk                               /*!<  Tx Data register */

/********************  Bit definition for CEC_RXD register  ******************/
#define CEC_RXD_RXD_Pos          (0U)                                          
#define CEC_RXD_RXD_Msk          (0xFFUL << CEC_RXD_RXD_Pos)                    /*!< 0x000000FF */
#define CEC_RXD_RXD              CEC_RXD_RXD_Msk                               /*!<  Rx Data register */

/*****************************************************************************/
/*                                                                           */
/*                               Timers (TIM)                                */
/*                                                                           */
/*****************************************************************************/
/*******************  Bit definition for TIM_CR1 register  *******************/
#define TIM_CR1_CEN_Pos                     (0U)                               
#define TIM_CR1_CEN_Msk                     (0x1UL << TIM_CR1_CEN_Pos)          /*!< 0x00000001 */
#define TIM_CR1_CEN                         TIM_CR1_CEN_Msk                    /*!<Counter enable */
#define TIM_CR1_UDIS_Pos                    (1U)                               
#define TIM_CR1_UDIS_Msk                    (0x1UL << TIM_CR1_UDIS_Pos)         /*!< 0x00000002 */
#define TIM_CR1_UDIS                        TIM_CR1_UDIS_Msk                   /*!<Update disable */
#define TIM_CR1_URS_Pos                     (2U)                               
#define TIM_CR1_URS_Msk                     (0x1UL << TIM_CR1_URS_Pos)          /*!< 0x00000004 */
#define TIM_CR1_URS                         TIM_CR1_URS_Msk                    /*!<Update request source */
#define TIM_CR1_OPM_Pos                     (3U)                               
#define TIM_CR1_OPM_Msk                     (0x1UL << TIM_CR1_OPM_Pos)          /*!< 0x00000008 */
#define TIM_CR1_OPM                         TIM_CR1_OPM_Msk                    /*!<One pulse mode */
#define TIM_CR1_DIR_Pos                     (4U)                               
#define TIM_CR1_DIR_Msk                     (0x1UL << TIM_CR1_DIR_Pos)          /*!< 0x00000010 */
#define TIM_CR1_DIR                         TIM_CR1_DIR_Msk                    /*!<Direction */

#define TIM_CR1_CMS_Pos                     (5U)                               
#define TIM_CR1_CMS_Msk                     (0x3UL << TIM_CR1_CMS_Pos)          /*!< 0x00000060 */
#define TIM_CR1_CMS                         TIM_CR1_CMS_Msk                    /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0                       (0x1UL << TIM_CR1_CMS_Pos)          /*!< 0x00000020 */
#define TIM_CR1_CMS_1                       (0x2UL << TIM_CR1_CMS_Pos)          /*!< 0x00000040 */

#define TIM_CR1_ARPE_Pos                    (7U)                               
#define TIM_CR1_ARPE_Msk                    (0x1UL << TIM_CR1_ARPE_Pos)         /*!< 0x00000080 */
#define TIM_CR1_ARPE                        TIM_CR1_ARPE_Msk                   /*!<Auto-reload preload enable */

